openfoam_template/0.orig/nut
/*---------------------------------------------------------------------------*\
 Caelus contributors                           
 Web:      www.caelus-cml.com 
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-12;

boundaryField
{
    airfoil
    {
        type            calculated;
        value           uniform 1e-12;
    }
    farfield
    {
        type            calculated;
        value           uniform 1e-12;
    }
    side1
    {
        type            empty;
    }
    side2
    {
        type            empty;
    }
}


// ************************************************************************* //
