openfoam_template/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default        Gauss linear;
}

divSchemes
{
    default                      none;
    div(phi,U)                   Gauss linearUpwindBJ grad(U);
    div((nuEff*dev(T(grad(U))))) Gauss linear;
    div(devRhoReff)              Gauss linear;
    div(phi,k)                   Gauss linear;
    div(phi,omega)               Gauss linear;
    div(phi,nuTilda)             Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p               ;
    pPrime          ;
    Phi;
}


// ************************************************************************* //
